/*
Вам заданы два целых числа A и B. Выведите A+B.

Входные данные
Единственная строка входных данных содержит два целых числа A 
и B (|a|,|b|⩽100).

Выходные данные
Выведите A+B
.*/

#include <iostream>

using namespace std;

int main() {
    int a, b;
    cin >> a >> b;
    cout << a + b << endl;
}